"""
Дано целое число N (>0) и строка S. Преобразовать строку S в строку длины N
следующим образом: если длина строки S больше N, то отбросить первые символы,
если длина строки S меньше N, то в ее начало добавить символы «.» (точка).
"""

# Вводим целое число N и строку S
N = int(input("Введите целое число N (>0): "))
S = input("Введите строку S: ")

# Проверяем длину строки S
if len(S) > N:
    # Если S длиннее N, берем последние N символов
    result = S[-N:]
else:
    # Если S короче или равна N, добавляем точки в начало
    result = '.' * (N - len(S)) + S

# Выводим результат
print("Преобразованная строка:", result)
