# Вариант 25

# Даны координаты поля шахматной доски х, у (целые числа, лежащие в диапазоне 1-8).
# Учитывая, что левое нижнее поле доски (1,1) является черным, проверить истинность высказывания: 
#«Данное поле является белым».

try:
    x = int(input('Введите координату x: '))
    y = int(input('Введите координату y: '))

    if x<1 or x>8 or y<1 or y>8:
        print('ошибка! координаты должны быть в диапазоне от 1 до 8')
    elif (x + y) % 2 == 0:
        print('данное поле является белым')
    else:
        print('данное поле является черным')

except ValueError:
    print('Ошибка! введите числовое значение координат')

