# ВАРИАНТ 17

# Исходные данные: имена девочек и группы вторых курсов
girls_names = {'Анна', 'Мария', 'Елена', 'Ольга', 'Татьяна', 'Анастасия'}

group1 = {'Анна', 'Мария', 'Елена'}

group2 = {'Анна', 'Ольга', 'Татьяна', 'Елена'}

group3 = {'Мария', 'Елена', 'Ольга'}

# 1. Имена, встречающиеся во всех группах
common_names = group1 & group2 & group3
print("Имена, которые есть во всех группах:", common_names)

# 2. Имена, встречающиеся только в некоторых группах
some_groups_names = (group1 | group2 | group3) - common_names
print("Имена, которые есть только в некоторых группах:", some_groups_names)

# 3. Имена, которые не встречаются ни в одной из групп
not_in_any_group = girls_names - (group1 | group2 | group3)
print("Имена, которых нет ни в одной группе:", not_in_any_group)